In [2]:
import pandas as pd
import numpy as np

In [7]:
pd.__version__

'1.4.1'

In [8]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 06d230151e6f18fdb8139d09abf539867a8cd481
python           : 3.8.13.final.0
python-bits      : 64
OS               : Linux
OS-release       : 5.15.0-27-generic
Version          : #28-Ubuntu SMP Thu Apr 14 04:55:28 UTC 2022
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : it_IT.UTF-8
LOCALE           : it_IT.UTF-8

pandas           : 1.4.1
numpy            : 1.22.3
pytz             : 2022.1
dateutil         : 2.8.2
pip              : 22.0.4
setuptools       : 61.2.0
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.1
IPython          : 8.2.0
pandas_datareader: None
bs4              : 4.10.0
bottleneck       : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.5.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.8.0
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

# Create an example DataFrame

In [14]:
df = pd.DataFrame({"col one":[100, 200], "col two":[300, 400], "terza colonna":["andrea", "eleonora"]})

In [16]:
df

   col one  col two terza colonna
0      100      300        andrea
1      200      400      eleonora

# Rename Columns

In [19]:
df = df.rename({"col one": "col_one", "col two": "col_two"}, axis="columns")

In [20]:
df

   col_one  col_two terza colonna
0      100      300        andrea
1      200      400      eleonora

In [21]:
df.columns.str.replace("_", "--")

Index(['col--one', 'col--two', 'terza colonna'], dtype='object')

In [23]:
df.add_prefix("X_")

   X_col_one  X_col_two X_terza colonna
0        100        300          andrea
1        200        400        eleonora

In [24]:
df.add_suffix("_Y")

   col_one_Y  col_two_Y terza colonna_Y
0        100        300          andrea
1        200        400        eleonora

# Reverse row order

In [28]:
df.loc[::-1].reset_index(drop=True)

   col_one  col_two terza colonna
0      200      400      eleonora
1      100      300        andrea

# Reverse column order

In [30]:
df.loc[:,::-1].reset_index(drop=True)

  terza colonna  col_two  col_one
0        andrea      300      100
1      eleonora      400      200

# Select Columns by data type

In [31]:
df.select_dtypes(include="object") # seleziono solo colonne che NON contengono numeri

  terza colonna
0        andrea
1      eleonora

In [34]:
df.select_dtypes(exclude="object") # colonne SOLO numeri

   col_one  col_two
0      100      300
1      200      400

# Converting string to numbers

In [3]:
df = pd.DataFrame({
    "col_one":["1", "2", "3"],
    "col_two": ["4", "5", "6"]})

In [4]:
df = df.add_prefix("str_")

In [5]:
df

  str_col_one str_col_two
0           1           4
1           2           5
2           3           6

In [6]:
df.dtypes # numeri inseriti come stringhe

str_col_one    object
str_col_two    object
dtype: object

In [43]:
df = df.astype({"str_col_one": "int", "str_col_two": "int"})

In [45]:
df.dtypes

str_col_one    int64
str_col_two    int64
dtype: object

In [13]:
df = df.apply(pd.to_numeric, errors="coerce").fillna(0)

In [15]:
df.dtypes

str_col_one    int64
str_col_two    int64
dtype: object

# Build a DataFrame from multiple files (row-wise)

```
pd.read_csv("mio_file_1.csv")
pd.read_csv("mio_file_2.csv")
pd.read_csv("mio_file_3.csv")
```


> from glob import glob

```
stock_files = sorted(glob("mio_file_*.csv"))
stock_files
```

```
pd.concat((pd.read_csv(file) for file in stock_files))
```
concat unisce in unico dataframe le fonti passate alla funzione

oppure:
```
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)
```

In [16]:
from glob import glob

In [27]:
g_files = sorted(glob("../*/**.csv"))

In [29]:
g_files

['../Data_Analisys/Incidenti_stradali.csv',
 '../Data_Analisys/giocatori.csv',
 '../JupyterLab/giocatori.csv',
 '../JupyterLab/prodotti.csv',
 '../Selenium_libreria/citta_latine.csv',
 '../Selenium_libreria/citt√†_latine_compilato.csv',
 '../machineLearningPitone/giocatori.csv']

# Build a DataFrame from multiple files (column-wise)

Cambia solo una fase del progetto:
```
pd.concat((pd.read_csv(file) for file in g_files), axis="columns")
```

# Create a DataFrame from the clipboar

````
df = pd.read_clipboard()
```
Errore in linux, da verificare
# RISOLVERE

# Split a DataFrame into two random subsets

In [68]:
movies = pd.DataFrame({"col_one":[x for x in range(0,1000)], "col_two":[x for x in range(0,1000)]})

In [69]:
movies.head()

   col_one  col_two
0        0        0
1        1        1
2        2        2
3        3        3
4        4        4

In [70]:
movies_1 = movies.sample(frac=0.30, random_state=1234)
movies_2 = movies.drop(movies_1.index)

In [71]:
movies_1.head(3)

     col_one  col_two
681      681      681
990      990      990
155      155      155

In [72]:
movies_2.head(3)

   col_one  col_two
0        0        0
1        1        1
2        2        2

In [73]:
print("numero Totale righe dataframe:",len(movies))
print("numero righe set 1:",len(movies_1))
print("numero righe set 2:", len(movies_2))

numero Totale righe dataframe: 1000
numero righe set 1: 300
numero righe set 2: 700

# Filter a DataFrame by multiple categories

In [79]:
movies = pd.DataFrame({"col_one":[x for x in range(0,1000)], "col_two":[x for x in range(0,1000)]})

In [82]:
movies.dtypes

col_one    int64
col_two    int64
dtype: object

In [85]:
movies[movies["col_one"].isin([10, 40, 100])]

     col_one  col_two
10        10       10
40        40       40
100      100      100

In [91]:
movies[~movies["col_one"].isin([10, 100, 1000])].head(5) # la tilde ESCLUDE (not operator in python)

   col_one  col_two
0        0        0
1        1        1
2        2        2
3        3        3
4        4        4